## 2장 9절 데이터프레임에 함수 적용하기

###  1. Apply

In [1]:
import pandas as pd
import numpy as np

In [2]:
score = {'Grade':[1,1,1,1,2,2,], 'Class':['A','A','B','B','C','C'], 'Gender':['F','M','F','M','F','M'],
           'Score':[76, 88, 85, 72, 68, 70]}
df_score = pd.DataFrame(data=score)
df_score

   Grade Class Gender  Score
0      1     A      F     76
1      1     A      M     88
2      1     B      F     85
3      1     B      M     72
4      2     C      F     68
5      2     C      M     70

In [3]:
df_score = df_score.pivot_table(index=['Grade','Class'], columns='Gender', values='Score')
df_score

Gender        F   M
Grade Class
1     A      76  88
      B      85  72
2     C      68  70

In [4]:
df_score.apply(np.sqrt, axis=0)

Gender              F         M
Grade Class
1     A      8.717798  9.380832
      B      9.219544  8.485281
2     C      8.246211  8.366600

In [5]:
df_score.apply(np.max, axis=0)

Gender
F    85
M    88
dtype: int64

In [6]:
def plus_five(val):
    return val+5
df_score.apply(plus_five)

Gender        F   M
Grade Class
1     A      81  93
      B      90  77
2     C      73  75

In [7]:
def class_avg(df):
    return np.ceil((df['M'] + df['F'])/2)
df_score.apply(class_avg, axis=1)

Grade  Class
1      A        82.0
       B        79.0
2      C        69.0
dtype: float64

### 2. Map : 주어진 각 원소에 함수를 적용

In [8]:
df_score['M'].map(lambda x: x+5)

Grade  Class
1      A        93
       B        77
2      C        75
Name: M, dtype: int64

In [9]:
df_score['M'].apply(plus_five)

Grade  Class
1      A        93
       B        77
2      C        75
Name: M, dtype: int64